// Напишите программу, которая будет преобразовывать десятичное число в двоичное
Console.WriteLine (Convert.ToString(int.Parse(Console.ReadLine()),2));